day-08/day-08.org
* Spacemacs Rocks Season 2 (day-08)
** elpa mirrors
- https://mirrors.tuna.tsinghua.edu.cn/help/elpa/
- https://github.com/emacs-china/elpa

** Cask and pallet
*** Install cask
- https://github.com/cask/cask

#+BEGIN_SRC shell
  # if your emacs installeb by brew, not recommand to use this way
  brew install cask

  # universal install
  curl -fsSL https://raw.githubusercontent.com/cask/cask/master/go | python
#+END_SRC

- add `export PATH="/Users/changfeng/.cask/bin":$PATH` to ~/.zshenv
- delete ~/.emacs.d/.cask directory

*** Install pallet
- referinces: https://github.com/rdallasgray/pallet/tree/b8d0df1883224a371ac0a3bc9b9c1c4dc61e6ac0
- M-x package-refresh-contents RET M-x package-install RET pallet
- M-x pallet-mo(require 'cask "<path-to-cask>/cask.el")
(cask-initialize)
(require 'pallet)
(pallet-mode t)de
- M-x pallet-init
- M-x pallet-install 
  + if execute failed, you can manual copy ~/.emacs.d/elpa to ~/.emacs.d/.cask, after this you can delete ~/.emacs.d/elpa directory
  + if has some dependences, just only copy from original `elpa` to ~/.emacs.d/.cask/26.3/elpa
- Finally, make sure the following lines are in your init.el(in my case is: ~/.emacs.d/vincent.org), before any packages are required:
#+BEGIN_SRC org mode
  ,** Pallet
  ,#+BEGIN_SRC emacs-lisp
  (require 'cask "~/.cask/cask.el")
  (cask-initialize)
  (require 'pallet)
  (pallet-mode t)

  ,#+END_SRC
#+END_SRC

- comment or delete your `init-packages.el` some configure, like this
#+BEGIN_SRC emacs-lisp
  (when (>= emacs-major-version 24)
    (require 'package)
    (setq package-archives '(("gnu-tuna"    .  "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
			     ("melpa-tuna"  .  "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"))))

  ;; add whatever package you want here
  (defvar vincent/packages '(
			     company
			     dracula-theme
			     monokai-theme
			     hungry-delete
			     counsel
			     swiper
			     smartparens
			     exec-path-from-shell
			     js2-mode
			     nodejs-repl
			     popwin
			     reveal-in-osx-finder
			     web-mode
			     js2-refactor
			     expand-region
			     iedit
			     org-pomodoro
			     helm-ag
			     flycheck
			     auto-yasnippet
			     base16-theme
			     snazzy-theme
			     colemak-evil
			     evil-colemak-basics
			     evil
			     evil-leader
			     evil-surround
			     evil-nerd-commenter
			     which-key
			     ) "Default packages")
  (setq package-selected-packages vincent/packages)

  (defun vincent/packages-installed-p ()
    (loop for pkg in vincent/packages
	  when (not (package-installed-p pkg)) do (return nil)
	  finally (return t)))

  (unless (vincent/packages-installed-p)
    (message "%s" "Refreshing package database...")
    (package-refresh-contents)
    (dolist (pkg vincent/packages)
      (when (not (package-installed-p pkg))
	(package-install pkg))))
#+END_SRC

*** Configure pallet CN Mirrors

- Just edit ~/.emacs.d/Cask like this

#+BEGIN_SRC emacs-lisp
  (source "gnu-tuna" "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
  (source "melpa-tuna" "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")

  (depends-on "2048-game")
  (depends-on "abc-mode")
  (depends-on "alert")
#+END_SRC
