day-08/day-08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-27 Fri 13:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="vincent" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5804af6">1. Spacemacs Rocks Season 2 (day-08)</a>
<ul>
<li><a href="#orge92bddc">1.1. elpa mirrors</a></li>
<li><a href="#orge9d8e87">1.2. Cask and pallet</a>
<ul>
<li><a href="#orgb42a2e3">1.2.1. Install cask</a></li>
<li><a href="#org005f855">1.2.2. Install pallet</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5804af6" class="outline-2">
<h2 id="org5804af6"><span class="section-number-2">1</span> Spacemacs Rocks Season 2 (day-08)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge92bddc" class="outline-3">
<h3 id="orge92bddc"><span class="section-number-3">1.1</span> elpa mirrors</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://mirrors.tuna.tsinghua.edu.cn/help/elpa/">https://mirrors.tuna.tsinghua.edu.cn/help/elpa/</a></li>
<li><a href="https://github.com/emacs-china/elpa">https://github.com/emacs-china/elpa</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge9d8e87" class="outline-3">
<h3 id="orge9d8e87"><span class="section-number-3">1.2</span> Cask and pallet</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgb42a2e3" class="outline-4">
<h4 id="orgb42a2e3"><span class="section-number-4">1.2.1</span> Install cask</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="https://github.com/cask/cask">https://github.com/cask/cask</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #6272a4;"># </span><span style="color: #6272a4;">if your emacs installeb by brew, not recommand to use this way</span>
brew install cask

<span style="color: #6272a4;"># </span><span style="color: #6272a4;">universal install</span>
curl -fsSL https://raw.githubusercontent.com/cask/cask/master/go | python
</pre>
</div>

<ul class="org-ul">
<li>add `export PATH="<i>Users/changfeng</i>.cask/bin":$PATH` to ~/.zshenv</li>
<li>delete ~/.emacs.d/.cask directory</li>
</ul>
</div>
</div>

<div id="outline-container-org005f855" class="outline-4">
<h4 id="org005f855"><span class="section-number-4">1.2.2</span> Install pallet</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>referinces: <a href="https://github.com/rdallasgray/pallet/tree/b8d0df1883224a371ac0a3bc9b9c1c4dc61e6ac0">https://github.com/rdallasgray/pallet/tree/b8d0df1883224a371ac0a3bc9b9c1c4dc61e6ac0</a></li>
<li>M-x package-refresh-contents RET M-x package-install RET pallet</li>
<li>M-x pallet-mo(require 'cask "&lt;path-to-cask&gt;/cask.el")</li>
</ul>
<p>
(cask-initialize)
(require 'pallet)
(pallet-mode t)de
</p>
<ul class="org-ul">
<li>M-x pallet-init</li>
<li>M-x pallet-install 
<ul class="org-ul">
<li>if execute failed, you can manual copy ~/.emacs.d/elpa to ~/.emacs.d/.cask, after this you can delete ~/.emacs.d/elpa directory</li>
<li>if has some dependences, just only copy from original `elpa` to ~/.emacs.d/.cask/26.3/elpa</li>
</ul></li>
<li>Finally, make sure the following lines are in your init.el(in my case is: ~/.emacs.d/vincent.org), before any packages are required:</li>
</ul>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #bd93f9; font-size: 110%; font-weight: bold;">** Pallet</span>
<span style="color: #6272a4;">#+BEGIN_SRC emacs-lisp</span>
<span style="color: #ffb86c;">(</span><span style="color: #ff79c6; font-weight: bold;">require</span><span style="color: #ffb86c;"> '</span><span style="color: #8be9fd;">cask</span><span style="color: #ffb86c;"> </span><span style="color: #f1fa8c;">"~/.cask/cask.el"</span><span style="color: #ffb86c;">)</span>
<span style="color: #ffb86c;">(cask-initialize)</span>
<span style="color: #ffb86c;">(</span><span style="color: #ff79c6; font-weight: bold;">require</span><span style="color: #ffb86c;"> '</span><span style="color: #8be9fd;">pallet</span><span style="color: #ffb86c;">)</span>
<span style="color: #ffb86c;">(pallet-mode t)</span>

<span style="color: #6272a4;">#+END_SRC</span>
</pre>
</div>
<ul class="org-ul">
<li>comment or delete your `init-packages.el` some configure, like this</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">when</span> (&gt;= emacs-major-version 24)
  (<span style="color: #ff79c6; font-weight: bold;">require</span> '<span style="color: #8be9fd;">package</span>)
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> package-archives '((<span style="color: #f1fa8c;">"gnu-tuna"</span>    .  <span style="color: #f1fa8c;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/"</span>)
                           (<span style="color: #f1fa8c;">"melpa-tuna"</span>  .  <span style="color: #f1fa8c;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"</span>))))

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">add whatever package you want here</span>
(<span style="color: #ff79c6; font-weight: bold;">defvar</span> <span style="color: #f8f8f2; font-weight: bold;">vincent/packages</span> '(
                           company
                           dracula-theme
                           monokai-theme
                           hungry-delete
                           counsel
                           swiper
                           smartparens
                           exec-path-from-shell
                           js2-mode
                           nodejs-repl
                           popwin
                           reveal-in-osx-finder
                           web-mode
                           js2-refactor
                           expand-region
                           iedit
                           org-pomodoro
                           helm-ag
                           flycheck
                           auto-yasnippet
                           base16-theme
                           snazzy-theme
                           colemak-evil
                           evil-colemak-basics
                           evil
                           evil-leader
                           evil-surround
                           evil-nerd-commenter
                           which-key
                           ) <span style="color: #6272a4;">"Default packages"</span>)
(<span style="color: #ff79c6; font-weight: bold;">setq</span> package-selected-packages vincent/packages)

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">vincent/packages-installed-p</span> ()
  (<span style="color: #ff79c6; font-weight: bold;">loop</span> for pkg in vincent/packages
        when (not (package-installed-p pkg)) do (<span style="color: #ff79c6; font-weight: bold;">return</span> nil)
        finally (<span style="color: #ff79c6; font-weight: bold;">return</span> t)))

(<span style="color: #ff79c6; font-weight: bold;">unless</span> (vincent/packages-installed-p)
  (message <span style="color: #f1fa8c;">"%s"</span> <span style="color: #f1fa8c;">"Refreshing package database..."</span>)
  (package-refresh-contents)
  (<span style="color: #ff79c6; font-weight: bold;">dolist</span> (pkg vincent/packages)
    (<span style="color: #ff79c6; font-weight: bold;">when</span> (not (package-installed-p pkg))
      (package-install pkg))))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: vincent</p>
<p class="date">Created: 2020-03-27 Fri 13:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
